Documents/ЛБ_РегламентноеНачислениеПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РегламентноеНачислениеПроцентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_РегламентноеНачислениеПроцентов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Дата = ТекущаяДата();   
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;   
	СписокЛомбардов = Объект.СтрокаЛомбарды;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);	
КонецПроцедуры

&НаСервере
Функция ПередЗаписьюПроверитьЕстьРегламентноеНачислениеПроцентов()
	Возврат ЛБ_ОбщийМодуль.ПроверитьЕстьРегламентноеНачислениеПроцентов(Объект);   
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписидокумента.Проведение Тогда
		//СтрокаСообщения = ПередЗаписьюПроверитьЕстьРегламентноеНачислениеПроцентов();
		//Если НЕ ПустаяСтрока(СтрокаСообщения) Тогда   
		//	Сообщить(СтрокаСообщения);
		//	Отказ = Истина;
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;   
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры
